[
    {
        "id": "1",
        "name": "Information and Data Literacy",
        "competences": [
            {
                "id": "1.1",
                "name": "Browsing, Searching and Filtering Data, Information and Digital Content",
                "dimensions": [
                    {
                        "id": "1.1.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can identify my information needs, find data, information and content through a simple search in digital environments.",
                            "At basic level and with guidance, I can find how to access these data, information and content and navigate between them.",
                            "At basic level and with guidance, I can identify simple personal search strategies."
                        ]
                    },{
                        "id": "1.1.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify my information needs.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can find data, information and content through a simple search in digital environments.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can find how to access these data, information and content and navigate between them.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify simple personal search strategies."
                        ]
                    },{
                        "id": "1.1.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can explain my information needs.",
                            "On my own and solving straightforward problems, I can perform well-defined and routine searches to find data, information and content in digital environments.",
                            "On my own and solving straightforward problems, I can explain how to access them and navigate between them.",
                            "On my own and solving straightforward problems, I can explain well-defined and routine personal search strategies."
                        ]
                    },{
                        "id": "1.1.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can illustrate information needs.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can organise the searches of data, information and content in digital environments.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can describe how to access these data, information and content, and navigate between them.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can organise personal search strategies."
                        ]
                    },{
                        "id": "1.1.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can respond to information needs.",
                            "As well as guiding others, I can apply searches to obtain data, information and content in digital environments.",
                            "As well as guiding others, I can show how to access these data, information and content and navigate between them.",
                            "As well as guiding others, I can propose personal search strategies."
                        ]
                    },{
                        "id": "1.1.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can assess information needs.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can adapt my searching strategy to find the most appropriate data, information and content in digital environments.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can explain how to access these most appropriate data, information and content and navigate among them.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can vary personal search strategies."
                        ]
                    },{
                        "id": "1.1.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to browsing, searching and filtering of data, information and digital content.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practice and knowledge and guide others in browsing, searching and filtering data, information and digital content."
                        ]
                    },{
                        "id": "1.1.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to browsing, searching and filtering data, information and digital content.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "1.2",
                "name": "Evaluating Data, Information and Digital Content",
                "dimensions": [
                    {
                        "id": "1.2.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can detect the credibility and reliability of common sources of data, information and their digital content."
                        ]
                    },{
                        "id": "1.2.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can detect the credibility and reliability of common sources of data, information and their digital content."
                        ]
                    },{
                        "id": "1.2.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can perform the analysis, comparison and evaluation of the credibility and reliability of well-defined sources of data, information and digital content.",
                            "On my own and solving straightforward problems, I can perform the analysis, interpretation and evaluation of well-defined data, information and digital content."
                        ]
                    },{
                        "id": "1.2.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can perform the analysis, comparison and evaluation of sources of data, information and digital content.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can perform the analysis, interpretation and evaluation of data, information and digital content."
                        ]
                    },{
                        "id": "1.2.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can carry out an evaluation of the credibility and reliability of different sources of data, information and digital content.",
                            "As well as guiding others, I can carry out an evaluation of different data, information and digital content."
                        ]
                    },{
                        "id": "1.2.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can critically assess the credibility and reliability of sources of data, information and digital content.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can critically assess data, information and digital content."
                        ]
                    },{
                        "id": "1.2.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to analysing and evaluating credible and reliable sources of data, information and content in digital environments.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practices and knowledge and to guide others in the analysis and evaluation of the credibility and reliability of data, information and digital content and their sources."
                        ]
                    },{
                        "id": "1.2.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting.",
                            "At the most advanced and specialised level, I can factors that are related to analysing and evaluating credible and reliable.",
                            "At the most advanced and specialised level, I can sources of data, information and content in digital environments.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "1.3",
                "name": "Managing Data, Information and Digital Content",
                "dimensions": [
                    {
                        "id": "1.3.1",
                        "level": "",
                        "skills": [
                            "At basic level and with guidance, I can identify how to organise, store and retrieve data, information and content in a simple way in digital environments.",
                            "At basic level and with guidance, I can recognise where to organise them in a simple way in a structured environment."
                        ]
                    },{
                        "id": "1.3.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify how to organise, store and retrieve data, information and content in a simple way in digital environments.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can recognise where to organise them in a simple way in a structured environment."
                        ]
                    },{
                        "id": "1.3.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can select data, information and content in order to organise, store and retrieve them in a routine way in digital environments.",
                            "On my own and solving straightforward problems, I can organise them in a routine way in a structured environment."
                        ]
                    },{
                        "id": "1.3.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can organise information, data and content to be easily stored and retrieved.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can organise information, data and content in a structured environment."
                        ]
                    },{
                        "id": "1.3.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can manipulate information, data and content for their easier organisation, storage and retrieval.",
                            "As well as guiding others, I can carry out their organisation and processing in a structured environment."
                        ]
                    },{
                        "id": "1.3.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can adapt the management of information, data and content for the most appropriate easy retrieval and storage.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can adapt them to be organised and processed in the most appropriate structured environment."
                        ]
                    },{
                        "id": "1.3.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to managing data, information, and content for their organisation, storage and retrieval in a structured digital environment.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practices and knowledge and to guide others in managing data, information and digital content in a structured digital environment."
                        ]
                    },{
                        "id": "1.3.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to managing data, information, and content for their organisation, storage and retrieval in a structured digital environment.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            }
        ]
    },{
        "id": "2",
        "name": "Communication and Collaboration",
        "competences": [
            {
                "id": "2.1",
                "name": "Interacting through digital Technologies",
                "dimensions": [
                    {
                        "id": "2.1.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can select simple digital technologies to interact.",
                            "At basic level and with guidance, I can identify appropriate simple communication means for a given context."
                        ]
                    },{
                        "id": "2.1.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can select simple digital technologies to interact.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify appropriate simple communication means for a given context."
                        ]
                    },{
                        "id": "2.1.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can perform well-defined and routine interactions with digital technologies.",
                            "On my own and solving straightforward problems, I can select well-defined and routine appropriate digital communication means for a given context."
                        ]
                    },{
                        "id": "2.1.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can select a variety of digital technologies to interact.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can select a variety of appropriate digital communication means for a given context."
                        ]
                    },{
                        "id": "2.1.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can use a variety of digital technologies in order to interact.",
                            "As well as guiding others, I can show others the most appropriate digital communication means for a given context."
                        ]
                    },{
                        "id": "2.1.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can adapt a variety of digital technologies for the most appropriate interaction.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can adapt the most appropriate communication means for a given context."
                        ]
                    },{
                        "id": "2.1.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to interacting through digital technologies and digital communication means.",
                            "At highly specialised level, I can  integrate my knowledge to contribute to professional practices and knowledge and to guide others in the interaction through digital technologies."
                        ]
                    },{
                        "id": "2.1.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to interacting through digital technologies and digital communication means.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "2.2",
                "name": "Sharing through digital Technologies",
                "dimensions": [
                    {
                        "id": "2.2.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can recognise simple appropriate digital technologies to share data, information and digital content.",
                            "At basic level and with guidance, I can identify simple referencing and attribution practices."
                        ]
                    },{
                        "id": "2.2.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can recognise simple appropriate digital technologies to share data, information and digital content.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify simple referencing and attribution practices."
                        ]
                    },{
                        "id": "2.2.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can select well-defined and routine appropriate digital technologies to share data, information and digital content.",
                            "On my own and solving straightforward problems, I can explain how to act as an intermediary for sharing information and content through well-defined and routine digital technologies.",
                            "On my own and solving straightforward problems, I can illustrate well-defined and routine referencing and attribution practices."
                        ]
                    },{
                        "id": "2.2.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can manipulate appropriate digital technologies to share data, information and digital content.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can explain how to act as an intermediary for sharing information and content through digital technologies.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can illustrate referencing and attribution practices."
                        ]
                    },{
                        "id": "2.2.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can share data, information and digital content through a variety of appropriate digital tools.",
                            "As well as guiding others, I can show others how to act as an intermediary for sharing information and content through digital technologies.",
                            "As well as guiding others, I can apply a variety of referencing and attribution practices."
                        ]
                    },{
                        "id": "2.2.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can assess the most appropriate digital technologies to share information and content.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can adapt my intermediation role.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can vary the use of the more appropriate referencing and attribution practices."
                        ]
                    },{
                        "id": "2.2.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to sharing through digital technologies.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practices and knowledge and guide others in sharing through digital technologies."
                        ]
                    },{
                        "id": "2.2.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to sharing through digital technologies.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "2.3",
                "name": "Engaging Citizenship through digital Technology",
                "dimensions": [
                    {
                        "id": "2.3.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can identify simple digital services in order to participate in society.",
                            "At basic level and with guidance, I can recognise simple appropriate digital technologies to empower myself and to participate in society as a citizen."
                        ]
                    },{
                        "id": "2.3.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify simple digital services in order to participate in society.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can recognise simple appropriate digital technologies to empower myself and to participate in society as a citizen."
                        ]
                    },{
                        "id": "2.3.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can select well-defined and routine digital services in order to participate in society.",
                            "On my own and solving straightforward problems, I can indicate well-defined and routine appropriate digital technologies to empower myself and to participate in society as a citizen."
                        ]
                    },{
                        "id": "2.3.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can select digital services in order to participate in society.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can discuss appropriate digital technologies to empower myself and to participate in society as a citizen."
                        ]
                    },{
                        "id": "2.3.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can propose different digital services to participate in society.",
                            "As well as guiding others, I can use appropriate digital technologies to empower myself and to participate in society as a citizen."
                        ]
                    },{
                        "id": "2.3.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can vary the use of the most appropriate digital services in order to participate in society.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can vary the use of the most appropriate digital technologies to empower myself and to participate in society as a citizen."
                        ]
                    },{
                        "id": "2.3.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to engaging in citizenship through digital technologies.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practices and knowledge and guide others in engaging in citizenship through digital technologies."
                        ]
                    },{
                        "id": "2.3.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to engaging in citizenship through digital technologies.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "2.4",
                "name": "Collaborating through digital Technologies",
                "dimensions": [
                    {
                        "id": "2.4.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can choose simple digital tools and technologies for collaborative processes."
                        ]
                    },{
                        "id": "2.4.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can choose simple digital tools and technologies for collaborative processes."
                        ]
                    },{
                        "id": "2.4.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can select well-defined and routine digital tools and technologies for collaborative processes."
                        ]
                    },{
                        "id": "2.4.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can select digital tools and technologies for collaborative processes."
                        ]
                    },{
                        "id": "2.4.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can propose different digital tools and technologies for collaborative processes."
                        ]
                    },{
                        "id": "2.4.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can vary the use of the most appropriate digital tools and technologies for collaborative processes.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can choose the most appropriate digital tools and technologies for co-constructing and co-creating data, resources and knowledge."
                        ]
                    },{
                        "id": "2.4.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can vary the use of the most appropriate digital tools and technologies for collaborative processes.",
                            "At highly specialised level, I can choose the most appropriate digital tools and technologies for co-constructing and co-creating data, resources and knowledge."
                        ]
                    },{
                        "id": "2.4.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to using collaborative processes and co-construction and co-creation of data, resources and knowledge through digital tools and technologies.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "2.5",
                "name": "Netiquette",
                "dimensions": [
                    {
                        "id": "2.5.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can differentiate simple behavioural norms and know-how while using digital technologies and interacting in digital environments.",
                            "At basic level and with guidance, I can choose simple communication modes and strategies adapted to an audience.",
                            "At basic level and with guidance, I can differentiate simple cultural and generational diversity aspects to consider in digital environments."
                        ]
                    },{
                        "id": "2.5.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can differentiate simple behavioural norms and know-how while using digital technologies and interacting in digital environments.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can choose simple communication modes and strategies adapted to an audience.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can differentiate simple cultural and generational diversity aspects to consider in digital environments."
                        ]
                    },{
                        "id": "2.5.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can clarify well-defined and routine behavioural norms and know-how while using digital technologies and interacting in digital environments.",
                            "On my own and solving straightforward problems, I can express well-defined and routine communication strategies adapted to an audience.",
                            "On my own and solving straightforward problems, I can describe well-defined and routine cultural and generational diversity aspects to consider in digital environments."
                        ]
                    },{
                        "id": "2.5.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can discuss behavioural norms and know-how while using digital technologies and interacting in digital environments.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can discuss communication strategies adapted to an audience.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can discuss cultural and generational diversity aspects to consider in digital environments."
                        ]
                    },{
                        "id": "2.5.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can apply different behavioural norms and know-how while using digital technologies and interacting in digital environments.",
                            "As well as guiding others, I can apply different communication strategies in digital environments adapted to an audience.",
                            "As well as guiding others, I can apply different cultural and generational diversity aspects to consider in digital environments."
                        ]
                    },{
                        "id": "2.5.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can adapt the most appropriate behavioural norms and know-how while using digital technologies and interacting in digital environments.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can adapt the most appropriate communication strategies in digital environments to an audience.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can apply different cultural and generational diversity aspects in digital environments."
                        ]
                    },{
                        "id": "2.5.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to digital etiquettes respectful of different audiences and cultural and generational diversity.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practice and knowledge and guide others in digital etiquette."
                        ]
                    },{
                        "id": "2.5.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to digital etiquettes respectful to different audiences and cultural and generational diversity.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "2.6",
                "name": "Managing digital Identity",
                "dimensions": [
                    {
                        "id": "2.6.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can identify a digital identity.",
                            "At basic level and with guidance, I can describe simple ways to protect my reputation online.",
                            "At basic level and with guidance, I can recognise simple data I produce through digital tools, environments or services."
                        ]
                    },{
                        "id": "2.6.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify a digital identity.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can describe simple ways to protect my reputation online.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can recognise simple data I produce through digital tools, environments or services."
                        ]
                    },{
                        "id": "2.6.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can discriminate a range of well-defined and routine digital identities.",
                            "On my own and solving straightforward problems, I can explain well-defined and routine ways to protect my reputation online.",
                            "On my own and solving straightforward problems, I can describe well-defined data I routinely produce through digital tools, environments or services."
                        ]
                    },{
                        "id": "2.6.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can display a variety of specific digital identities.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can discuss specific ways to protect my reputation online.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can manipulate data I produce through digital tools, environments or services."
                        ]
                    },{
                        "id": "2.6.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can use a variety of digital identities.",
                            "As well as guiding others, I can apply different ways to protect my reputation online.",
                            "As well as guiding others, I can use data I produce through several digital tools environment and services."
                        ]
                    },{
                        "id": "2.6.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can discriminate multiple digital identities.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can explain the more appropriate ways to protect one’s own reputation.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can change the data produced through several tools, environments and services."
                        ]
                    },{
                        "id": "2.6.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to managing digital identities and protection of people’s online reputation.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practice and knowledge and guide others in managing digital identity."
                        ]
                    },{
                        "id": "2.6.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to managing digital identities and protection of people’s online reputation.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            }
        ]
    },{
        "id": "3",
        "name": "Digital Content Creation",
        "competences": [
            {
                "id": "3.1",
                "name": "Developing digital Content",
                "dimensions": [
                    {
                        "id": "3.1.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can identify ways to create and edit simple content in simple formats.",
                            "At basic level and with guidance, I can choose how I express myself through the creation of simple digital means."
                        ]
                    },{
                        "id": "3.1.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify ways to create and edit simple content in simple formats.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can choose how I express myself through the creation of simple digital means."
                        ]
                    },{
                        "id": "3.1.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can indicate ways to create and edit well-defined and routine content in well-defined and routine formats.",
                            "On my own and solving straightforward problems, I can express myself through the creation of well-defined and routine digital means."
                        ]
                    },{
                        "id": "3.1.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can indicate ways to create and edit content in different formats.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can express myself through the creation of digital means."
                        ]
                    },{
                        "id": "3.1.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can apply ways to create and edit content in different formats.",
                            "As well as guiding others, I can show ways to express myself through the creation of digital means."
                        ]
                    },{
                        "id": "3.1.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can change content using the most appropriate formats.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can adapt the expression of myself through the creation of the most appropriate digital means."
                        ]
                    },{
                        "id": "3.1.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to content creation and edition in different formats, and self-expression through digital means.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practice and knowledge and guide others in developing content."
                        ]
                    },{
                        "id": "3.1.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to content creation and edition in different formats, and self-expression through digital means.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "3.2",
                "name": "Interacting and Re-elaborating digital Content",
                "dimensions": [
                    {
                        "id": "3.2.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can select ways to modify, refine, improve and integrate simple items of new content and information to create new and original ones.",
                        ]
                    },{
                        "id": "3.2.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can select ways to modify, refine, improve and integrate simple items of new content and information to create new and original ones."
                        ]
                    },{
                        "id": "3.2.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can explain ways to modify, refine, improve and integrate well-defined items of new content and information to create new and original ones."
                        ]
                    },{
                        "id": "3.2.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can discuss ways to modify, refine, improve and integrate new content and information to create new and original ones."
                        ]
                    },{
                        "id": "3.2.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can operate with new different items of content and information, modifying, refining, improving and integrating them in order to create new and original ones."
                        ]
                    },{
                        "id": "3.2.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can assess the most appropriate ways to modify, refine, improve and integrate specific new items of content and information to create new and original ones."
                        ]
                    },{
                        "id": "3.2.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to modifying, refining, improving and integrating new content and information into existing knowledge to create new and original ones.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practice and knowledge and guide others in integrating and re-elaborating content."
                        ]
                    },{
                        "id": "3.2.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to modifying, refining, improving and integrating new content and information into existing knowledge to create new and original ones.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "3.3",
                "name": "Copyright and Licences",
                "dimensions": [
                    {
                        "id": "3.3.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can identify simple rules of copyright and licenses that apply to data, digital information and content."
                        ]
                    },{
                        "id": "3.3.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify simple rules of copyright and licenses that apply to data, digital information and content."
                        ]
                    },{
                        "id": "3.3.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can indicate well-defined and routine rules of copyright and licenses that apply to data, digital information and content."
                        ]
                    },{
                        "id": "3.3.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can discuss rules of copyright and licenses that apply to digital information and content."
                        ]
                    },{
                        "id": "3.3.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can apply different rules of copyright and licenses that apply to data, digital information and content."
                        ]
                    },{
                        "id": "3.3.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can choose the most appropriate rules that apply copyright and licences to data, digital information and content."
                        ]
                    },{
                        "id": "3.3.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to applying copyright and licenses to data, digital information and content.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practice and knowledge and guide others in applying copyright and licenses."
                        ]
                    },{
                        "id": "3.3.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to applying copyright and licenses to data, digital information and content.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "3.4",
                "name": "Programming",
                "dimensions": [
                    {
                        "id": "3.4.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can list simple instructions for a computing system to solve a simple problem or perform a simple task."
                        ]
                    },{
                        "id": "3.4.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can list simple instructions for a computing system to solve a simple problem or perform a simple task."
                        ]
                    },{
                        "id": "3.4.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can list well-defined and routine instructions for a computing system to solve routine problems or perform routine tasks."
                        ]
                    },{
                        "id": "3.4.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can list instructions for a computing system to solve a given problem or perform a specific task."
                        ]
                    },{
                        "id": "3.4.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can operate with instructions for a computing system to solve a different problem or perform different tasks."
                        ]
                    },{
                        "id": "3.4.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can determine the most appropriate instructions for a computing system to solve a given problem and perform specific tasks."
                        ]
                    },{
                        "id": "3.4.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to planning and developing instructions for a computing system and performing a task using a computing system.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practice and knowledge and guide others in programming."
                        ]
                    },{
                        "id": "3.4.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to planning and developing instructions for a computing system and performing a task using a computing system.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            }
        ]
    },{
        "id": "4",
        "name": "Safety",
        "competences": [
            {
                "id": "4.1",
                "name": "Protecting Devices",
                "dimensions": [
                    {
                        "id": "4.1.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can identify simple ways to protect my devices and digital content.",
                            "At basic level and with guidance, I can differentiate simple risks and threats in digital environments.",
                            "At basic level and with guidance, I can choose simple safety and security measures.",
                            "At basic level and with guidance, I can identify simple ways to have due regard to reliability and privacy."
                        ]
                    },{
                        "id": "4.1.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify simple ways to protect my devices and digital content.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can differentiate simple risks and threats in digital environments.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can follow simple safety and security measures.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify simple ways to have due regard to reliability and privacy."
                        ]
                    },{
                        "id": "4.1.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can indicate well-defined and routine ways to protect my devices and digital content.",
                            "On my own and solving straightforward problems, I can differentiate well-defined and routine risks and threats in digital environments.",
                            "On my own and solving straightforward problems, I can select well-defined and routine safety and security measures.",
                            "On my own and solving straightforward problems, I can indicate well-defined and routine ways to have due regard to reliability and privacy."
                        ]
                    },{
                        "id": "4.1.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can organise ways to protect my devices and digital content.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can differentiate risks and threats in digital environments.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can select safety and security measures.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can explain ways to have due regard to reliability and privacy."
                        ]
                    },{
                        "id": "4.1.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can apply different ways to protect devices and digital content.",
                            "As well as guiding others, I can differentiate a variety of risks and threats in digital environments.",
                            "As well as guiding others, I can apply safety and security measures.",
                            "As well as guiding others, I can employ different ways to have due regard to reliability and privacy."
                        ]
                    },{
                        "id": "4.1.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can choose the most appropriate protection for devices and digital content.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can discriminate risks and threats in digital environments.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can choose the most appropriate safety and security measures.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can assess the most appropriate ways to have due regard to reliability and privacy."
                        ]
                    },{
                        "id": "4.1.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to protecting devices and digital content, managing risks and threats, applying safety and security measures, and reliability and privacy in digital environments.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practice and knowledge and guide others in protecting devices."
                        ]
                    },{
                        "id": "4.1.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to protecting devices and digital content, managing risks and threats, applying safety and security measures, and reliability and privacy in digital environments.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "4.2",
                "name": "Protecting personal Data and Privacy",
                "dimensions": [
                    {
                        "id": "4.2.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can select simple ways to protect my personal data and privacy in digital environments.",
                            "At basic level and with guidance, I can identify simple ways to use and share personally identifiable information while protecting myself and others from damages.",
                            "At basic level and with guidance, I can identify simple privacy policy statements of how personal data is used in digital services."
                        ]
                    },{
                        "id": "4.2.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can select simple ways to protect my personal data and privacy in digital environments.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify simple ways to use and share personally identifiable information while protecting myself and others from damages.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify simple privacy policy statements of how personal data is used in digital services."
                        ]
                    },{
                        "id": "4.2.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can explain well-defined and routine ways to protect my personal data and privacy in digital environments.",
                            "On my own and solving straightforward problems, I can explain well-defined and routine ways to use and share personally identifiable information while protecting myself and others from damages.",
                            "On my own and solving straightforward problems, I can indicate well-defined and routine privacy policy statements of how personal data is used in digital services."
                        ]
                    },{
                        "id": "4.2.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can discuss ways to protect my personal data and privacy in digital environments.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can discuss ways to use and share personally identifiable information while protecting myself and others from damages.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can indicate privacy policy statements of how personal data is used in digital services."
                        ]
                    },{
                        "id": "4.2.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can apply different ways to protect my personal data and privacy in digital environments.",
                            "As well as guiding others, I can apply different specific ways to share my data while protecting myself and others from dangers.",
                            "As well as guiding others, I can explain privacy policy statements of how personal data is used in digital services."
                        ]
                    },{
                        "id": "4.2.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can choose the more appropriate ways to protect personal data and privacy in digital environments.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can evaluate the most appropriate ways of using and sharing personally identifiable information while protecting myself and others from damages.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can evaluate the appropriateness of privacy policy statements on how personal data are used."
                        ]
                    },{
                        "id": "4.2.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to protecting personal data and privacy in digital environments, using and sharing personally identifiable information protecting self and others from dangers, and privacy policies to use my personal data.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practice and knowledge and guide others in protecting personal data and privacy."
                        ]
                    },{
                        "id": "4.2.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to protecting personal data and privacy in digital environments, using and sharing personally identifiable information protecting self and others from dangers, and privacy policies to use my personal data.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "4.3",
                "name": "Protecting Health and Well-Being",
                "dimensions": [
                    {
                        "id": "4.3.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can differentiate simple ways to avoid health risks and threats to physical and psychological well-being while using digital technologies.",
                            "At basic level and with guidance, I can select simple ways to protect myself from possible dangers in digital environments.",
                            "At basic level and with guidance, I can identify simple digital technologies for social well-being and social inclusion."
                        ]
                    },{
                        "id": "4.3.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can differentiate simple ways to avoid health risks and threats to physical and psychological well-being while using digital technologies.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can select simple ways to protect myself from possible dangers in digital environments.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify simple digital technologies for social well-being and social inclusion."
                        ]
                    },{
                        "id": "4.3.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can explain well-defined and routine ways to how to avoid health risks and threats to physical and psychological well-being while using digital technologies.",
                            "On my own and solving straightforward problems, I can select well-defined and routine ways to protect myself from dangers in digital environments.",
                            "On my own and solving straightforward problems, I can indicate well-defined and routine digital technologies for social well-being and social inclusion."
                        ]
                    },{
                        "id": "4.3.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can explain ways to how to avoid threats to my physical and psychological health related with the use of technology.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can select ways to protect self and others from dangers in digital environments.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can discuss on digital technologies for social well-being and inclusion."
                        ]
                    },{
                        "id": "4.3.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can show different ways to avoid health-risks and threats to physical and psychological well-being while using digital technologies.",
                            "As well as guiding others, I can apply different ways to protect myself and others from dangers in digital environments.",
                            "As well as guiding others, I can show different digital technologies for social well-being and social inclusion."
                        ]
                    },{
                        "id": "4.3.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can discriminate the most appropriate ways to avoid health risks and threats to physical and psychological well-being while using digital technologies.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can adapt the most appropriate ways to protect myself and others from dangers in digital environments.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can vary the use of digital technologies for social well-being and social inclusion."
                        ]
                    },{
                        "id": "4.3.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to avoiding health -risks and threats to well-being while using digital technologies, to protect self and others from dangers in digital environments, and to the use of digital technologies for social well-being and social inclusion.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practice and knowledge and guide others in protecting health."
                        ]
                    },{
                        "id": "4.3.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to avoiding health risks and threats to well-being while using digital technologies, to protect self and others from dangers in digital environments, and to the use of digital technologies for social well-being and social inclusion.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "4.4",
                "name": "Protecting the Environment",
                "dimensions": [
                    {
                        "id": "4.4.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can recognise simple environmental impacts of digital technologies and their use."
                        ]
                    },{
                        "id": "4.4.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can recognise simple environmental impacts of digital technologies and their use."
                        ]
                    },{
                        "id": "4.4.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can indicate well-defined and routine environmental impacts of digital technologies and their use."
                        ]
                    },{
                        "id": "4.4.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can discuss ways to protect the environment from the impact of digital technologies and their use."
                        ]
                    },{
                        "id": "4.4.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can show different ways to protect the environment from the impact of digital technologies and their use."
                        ]
                    },{
                        "id": "4.4.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can choose the most appropriate solutions to protect the environment from the impact of digital technologies and their use."
                        ]
                    },{
                        "id": "4.4.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to protecting the environment from the impact of digital technologies and their use.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practice and knowledge and guide others in protecting the environment."
                        ]
                    },{
                        "id": "4.4.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to protecting the environment from the impact of digital technologies and their use.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            }
        ]
    },{
        "id": "5",
        "name": "Problem Solving",
        "competences": [
            {
                "id": "5.1",
                "name": "Solving technical Problems",
                "dimensions": [
                    {
                        "id": "5.1.1",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with guidance, I can identify simple technical problems when operating devices and using digital environments.",
                            "At basic level and with guidance, I can identify simple solutions to solve them."
                        ]
                    },{
                        "id": "5.1.2",
                        "level": "Foundation",
                        "skills": [
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify simple technical problems when operating devices and using digital environments.",
                            "At basic level and with autonomy and appropriate guidance where needed, I can identify simple solutions to solve them."
                        ]
                    },{
                        "id": "5.1.3",
                        "level": "Intermediate",
                        "skills": [
                            "On my own and solving straightforward problems, I can indicate well-defined and routine technical problems when operating devices and using digital environments.",
                            "On my own and solving straightforward problems, I can select well-defined and routine solutions to them."
                        ]
                    },{
                        "id": "5.1.4",
                        "level": "Intermediate",
                        "skills": [
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can differentiate technical problems when operating devices and using digital environments.",
                            "Independently, according to my own needs, and solving well-defined and non-routine problems, I can select solutions to them."
                        ]
                    },{
                        "id": "5.1.5",
                        "level": "Advanced",
                        "skills": [
                            "As well as guiding others, I can assess technical problems when using digital environments and operating digital devices.",
                            "As well as guiding others, I can apply different solutions to them."
                        ]
                    },{
                        "id": "5.1.6",
                        "level": "Advanced",
                        "skills": [
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can appraise technical problems when operating devices or working with digital environments.",
                            "At advanced level, according to my own needs and those of others, and in complex contexts, I can resolve technical problems with the most appropriate solution."
                        ]
                    },{
                        "id": "5.1.7",
                        "level": "Highly Specialised",
                        "skills": [
                            "At highly specialised level, I can create solutions to complex problems with limited definition that are related to technical problems when operating devices and using digital environments.",
                            "At highly specialised level, I can integrate my knowledge to contribute to professional practice and knowledge and to guide others in solving technical problems."
                        ]
                    },{
                        "id": "5.1.8",
                        "level": "Highly Specialised",
                        "skills": [
                            "At the most advanced and specialised level, I can create solutions to solve complex problems with many interacting factors that are related to technical problems when operating devices and using digital environments.",
                            "At the most advanced and specialised level, I can propose new ideas and processes to the field."
                        ]
                    }
                ]
            },{
                "id": "5.2",
                "name": "Identifying needs and technological Responses",
                "dimensions": [
                    {
                        "id": "5.2.1",
                        "level": "Foundation",
                        "skills": [

                        ]
                    },{
                        "id": "5.2.2",
                        "level": "Foundation",
                        "skills": [

                        ]
                    },{
                        "id": "5.2.3",
                        "level": "Intermediate",
                        "skills": [

                        ]
                    },{
                        "id": "5.2.4",
                        "level": "Intermediate",
                        "skills": [

                        ]
                    },{
                        "id": "5.2.5",
                        "level": "Advanced",
                        "skills": [

                        ]
                    },{
                        "id": "5.2.6",
                        "level": "Advanced",
                        "skills": [

                        ]
                    },{
                        "id": "5.2.7",
                        "level": "Highly Specialised",
                        "skills": [

                        ]
                    },{
                        "id": "5.2.8",
                        "level": "Highly Specialised",
                        "skills": [

                        ]
                    }
                ]
            },{
                "id": "5.3",
                "name": "Creatively using digital Technology",
                "dimensions": [
                    {
                        "id": "5.3.1",
                        "level": "Foundation",
                        "skills": [

                        ]
                    },{
                        "id": "5.3.2",
                        "level": "Foundation",
                        "skills": [

                        ]
                    },{
                        "id": "5.3.3",
                        "level": "Intermediate",
                        "skills": [

                        ]
                    },{
                        "id": "5.3.4",
                        "level": "Intermediate",
                        "skills": [

                        ]
                    },{
                        "id": "5.3.5",
                        "level": "Advanced",
                        "skills": [

                        ]
                    },{
                        "id": "5.3.6",
                        "level": "Advanced",
                        "skills": [

                        ]
                    },{
                        "id": "5.3.7",
                        "level": "Highly Specialised",
                        "skills": [

                        ]
                    },{
                        "id": "5.3.8",
                        "level": "Highly Specialised",
                        "skills": [

                        ]
                    }
                ]
            },{
                "id": "5.4",
                "name": "Identifying digital competence Gaps",
                "dimensions": [
                    {
                        "id": "5.4.1",
                        "level": "Foundation",
                        "skills": [

                        ]
                    },{
                        "id": "5.4.2",
                        "level": "Foundation",
                        "skills": [

                        ]
                    },{
                        "id": "5.4.3",
                        "level": "Intermediate",
                        "skills": [

                        ]
                    },{
                        "id": "5.4.4",
                        "level": "Intermediate",
                        "skills": [

                        ]
                    },{
                        "id": "5.4.5",
                        "level": "Advanced",
                        "skills": [

                        ]
                    },{
                        "id": "5.4.6",
                        "level": "Advanced",
                        "skills": [

                        ]
                    },{
                        "id": "5.4.7",
                        "level": "Highly Specialised",
                        "skills": [

                        ]
                    },{
                        "id": "5.4.8",
                        "level": "Highly Specialised",
                        "skills": [

                        ]
                    }
                ]
            }
        ]
    }
]